app/controllers/gossips_controller.rb

def create
	@gossip=Gossip.new(gossip_params)
	if @gossip.save
---
INSERT INTO "gossips" ("anonymous_author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["anonymous_author", "Fumeur de teuteu"], ["content", "Donald Trump est un agent de Valdimir Poutine"], ["created_at", "2018-01-31 13:51:24.149225"], ["updated_at", "2018-01-31 13:51:24.149225"]]

 def update
  	@gossip = Gossip.find(params[:id])
  	new_gossip = gossip_params
  	if @gossip.update(new_gossip)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = ?, "updated_at" = ? WHERE "gossips"."id" = ?  [["content", "Donald Trump est un agent de Vladimir Poutine"], ["updated_at", "2018-01-31 14:01:11.757061"], ["id", 1]]